{
  "ID": 7,
  "Title" : "Keira",
  "Summary":"3D modeling with Blender inspired by the character of Keira in the game Jak and Daxter™.",
  "Description": "3D model inspired by the character of Keira in the game Jak and Daxter™ released on PlayStation®2 in the 2000s. \n\n This model is the result of a project in duo with Maxime LUCAS in the context of a UV on image synthesis. We had to create a 3D character of our choice with Blender and stage it. The games Jak and Daxter being really close to my heart, I proposed to Maxime to create one of the three main characters. We went to Keira because it's usually the character that is the least revisited on the Internet. \n\n We divided the work in two, Maxime did the set and I did the character. I followed a tutorial found on YouTube, the result was very close to what I wanted to achieve. It was a first for me, the modeling (no sculpture in this case) of Keira took me about 50 hours. The most complicated for me was modeling her hair. I first made a first version with the Bézier curves, but I was not satisfied with the result, so I then used the particles for a much more convincing result. \n\n Other tutorials were also followed to create other parts like the eyes or some shaders. \n\n Once the elements of the scenery and the character created, we staged it in a village similar to the one in the first game. \n\n This is probably one of the projects I enjoyed the most and I hope to use this model again one day for a remake... Who knows?",
  "Date": 2020,
  "Period": "April 2020 - June 2020",
  "Type": "3D Modeling",
  "Personal": false,
  "Category": "Design",
  "Tags": ["#student", "#blender", "#3d"],
  "Images": [
    [0, "keira1.jpg", "Final rendering of Keira in a 3D environment"],
    [1, "keira2.jpg", "Keira (T pose)"],
    [2, "keira3.jpg", "Face of Keira"],
    [3, "keira4.jpg", "Screenshots showing the evolution of the 3D model"],
    [4, "keira5.jpg", "Screenshot showing the evolution of the 3D model"],
    [5, "keira6.jpg", "Staging of Keira"]
  ],
  "Hidden": false
}
