{
	"ID": 8,
	"Title" : "Simulation de foule",
	"Summary":"Simulation d'une foule (humains vs zombies) avec Unity3D dans le cadre d'un projet d'étudiant.",
  "Description": "Simulation d'une foule (humains vs zombies) avec Unity3D dans le cadre d'un projet d'étudiant avec Maxime LUCAS et Thomas GARCENOT. \n\n Au début du développement nous avons procédé à une phase de recherche sur les solutions qui pouvaient être utilisées avec Unity3D. Nous avons décidé de partir sur une solution assez simple, l'utilisation de l'outil de recherche du chemin le plus cours proposé par Unity. Les zombies marchent aléatoirement et cherchent un humain vers lequel se diriger. Les humains, quant à eux, cherchent à aller vers la zone de sécurité la plus proche. Lorsqu'ils rencontrent un ou plusieurs zombies, ils partent dans la direction opposée pendant un certain temps puis reprennent leur objectif initial. Le développement de cette solution est assez rapide et se révèle assez efficace en plus de répondre aux attendus du projet. \n\n Durant notre phase de recherche nous avons pris connaissance de l'outil MLAgent permettant de faire du Machine Learning dans Unity. Cette solution d'abord écartée, car un peu complexe, me plaisait quand même beaucoup. J'ai donc décidé de me donner 2 jours pour développer une solution alternative avec MLAgent. \n\n Première contact avec le Machine Learning réussi, puisque j'ai réussi à entraîner un humain avec un comportement très convaincant (les zombies gardent le comportement évoqué précédemment). L'entraînement a duré une vingtaine d'heures une fois l'environnement configuré avec les bons paramètres. Le plus intéressant a été la phase d'analyse afin de savoir quel bonus et malus à donner à l'agent pour qu'il progresse et cela de manière efficace. \n\n Lien vers une petite démo : <a href=\"https://youtu.be/ELFRRsvAH84\">https://youtu.be/ELFRRsvAH84</a>",
	"Date": 2020,
  "Period": "Avril 2020 - Juin 2020",
 	"Type": "Simulation d'une foule",
	"Personal": false,
  "Category": "Dev",
  "Tags": ["#étudiant", "#unity3d", "#ia"],
	"Images": [
    [0, "simulationIA1.jpg", "Capture d'écran de la simulation"],
    [1, "simulationIA2.jpg", "Capture d'écran du menu de la simulation"]
  ],
  "Hidden": false
}
